0x900C5649/nrf52_boards/source/ctap.c
// Copyright 2019 SoloKeys Developers
//
// Licensed under the Apache License, Version 2.0, <LICENSE-APACHE or
// http://apache.org/licenses/LICENSE-2.0> or the MIT license <LICENSE-MIT or
// http://opensource.org/licenses/MIT>, at your option. This file may not be
// copied, modified, or distributed except according to those terms.
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "cbor.h"

/*  LOG INIT  */
#define NRF_LOG_MODULE_NAME ctap

#include "nrf_log.h"
#include "nrf_log_ctrl.h"

NRF_LOG_MODULE_REGISTER();
/*            */

#include "ctap.h"
#include "u2f.h"
//#include "fido_hid.h"
#include "storage.h"
#include "ctap_parse.h"
#include "ctap_errors.h"
#include "cose_key.h"
#include "crypto.h"
#include "util.h"
#include "log.h"
#include "app_config.h"
#include "fido_interfaces.h"
//#include "extensions.h"
//#include "version.h"

#include "attestation.h"
#include "hal.h"


#define COUNTERID   0

/***************************************************************************** 
*							globals
*****************************************************************************/

uint8_t PIN_TOKEN[PIN_TOKEN_SIZE];
uint8_t KEY_AGREEMENT_PUB[ECC_PUBLIC_KEY_SIZE];
static uint8_t KEY_AGREEMENT_PRIV[ECC_PRIVATE_KEY_SIZE];
static int8_t PIN_BOOT_ATTEMPTS_LEFT = PIN_BOOT_ATTEMPTS;

AuthenticatorState STATE;

struct _getAssertionState getAssertionState;


/***************************************************************************** 
*						prototypes
*****************************************************************************/

static void ctap_state_init();
static void ctap_increment_rk_store();
static int is_matching_rk(CTAP_residentKey * rk, CTAP_residentKey * rk2);
static unsigned int get_credential_id_size(CTAP_credentialDescriptor * cred);
static uint8_t ctap_add_credential_descriptor(CborEncoder * map, CTAP_credentialDescriptor * cred);
static void save_credential_list(CTAP_authDataHeader * head, uint8_t * clientDataHash, CTAP_credentialDescriptor * creds, uint32_t count);
static CTAP_credentialDescriptor * pop_credential();
static int cred_cmp_func(const void * _a, const void * _b);
static int ctap_add_cose_key(CborEncoder * cose_key, uint8_t * x, uint8_t * y, uint8_t credtype, int32_t algtype);
static int ctap_generate_cose_key(CborEncoder * cose_key, uint8_t * hmac_input, int len, uint8_t credtype, int32_t algtype);
static uint16_t key_addr_offset(int index);
static void add_existing_user_info(CTAP_credentialDescriptor * cred);
static uint32_t auth_data_update_count(CTAP_authDataHeader * authData);
static int ctap_make_auth_data(struct rpId * rp, CborEncoder * map, uint8_t * auth_data_buf, uint32_t * len, CTAP_credInfo * credInfo);
static int ctap2_user_presence_test();
static int ctap_make_extensions(CTAP_extensions * ext, uint8_t * ext_encoder_buf, unsigned int * ext_encoder_buf_size);
static int trailing_zeros(uint8_t * buf, int indx);
static void ctap_reset_key_agreement();
uint8_t verify_pin_auth(uint8_t * pinAuth, uint8_t * clientDataHash);
int ctap_authenticate_credential(struct rpId * rp, CTAP_credentialDescriptor * desc);
int ctap_calculate_signature(uint8_t * data, int datalen, uint8_t * clientDataHash, uint8_t * hashbuf, uint8_t * sigbuf, uint8_t * sigder);
uint8_t ctap_add_attest_statement(CborEncoder * map, uint8_t * sigder, int len);
int ctap_filter_invalid_credentials(CTAP_getAssertion * GA);
uint8_t ctap_end_get_assertion(CborEncoder * map, CTAP_credentialDescriptor * cred, uint8_t * auth_data_buf, unsigned int auth_data_buf_sz, uint8_t * clientDataHash);
uint8_t ctap_add_user_entity(CborEncoder * map, CTAP_userEntity * user);
void make_auth_tag(uint8_t * rpIdHash, uint8_t * nonce, uint32_t count, uint8_t * tag);


/***************************************************************************** 
*							INIT
*****************************************************************************/

void ctap_init()
{
    NRF_LOG_INFO("INITING ctap");
/*    printf1(TAG_ERR,"Current firmware version address: %p\r\n", &firmware_version);
    printf1(TAG_ERR,"Current firmware version: %d.%d.%d.%d (%02x.%02x.%02x.%02x)\r\n",
            firmware_version.major, firmware_version.minor, firmware_version.patch, firmware_version.reserved,
            firmware_version.major, firmware_version.minor, firmware_version.patch, firmware_version.reserved
            );*/
//    crypto_ecc256_init();

    int is_init = read_ctap_state(&STATE);

    device_set_status(CTAP_STATUS_IDLE);

    if (is_init)
    {
        printf1(TAG_STOR,"Auth state is initialized\n");
    }
    else
    {   
        printf1(TAG_STOR, "initing ctap state");
        ctap_state_init();
        write_ctap_state(&STATE);
        //init counter only if need to init state
        counterInit(COUNTERID);
    }

    //do_migration_if_required(&STATE);

    crypto_load_master_secret(STATE.key_space);

    if (ctap_is_pin_set())
    {
        printf1(TAG_STOR, "attempts_left: %d\n", STATE.remaining_tries);
    }
    else
    {
        printf1(TAG_STOR,"pin not set.\n");
    }
    if (ctap_device_locked())
    {
        printf1(TAG_ERR, "DEVICE LOCKED!\n");
    }

    if (crypto_generate_rng(PIN_TOKEN, PIN_TOKEN_SIZE) != 1)
    {
        printf2(TAG_ERR,"Error, rng failed\n");
        exit(1);
    }

    ctap_reset_key_agreement();

#ifdef BRIDGE_TO_WALLET
    wallet_init();
#endif

}


/***************************************************************************** 
*							CTAP COMMANDS
*****************************************************************************/

uint8_t ctap_make_credential(CborEncoder * encoder, uint8_t * request, int length)
{
    CTAP_makeCredential MC;
    int ret;
    unsigned int i;
    uint8_t auth_data_buf[310];
    CTAP_credentialDescriptor * excl_cred = (CTAP_credentialDescriptor *) auth_data_buf;
    uint8_t * sigbuf = auth_data_buf + 32;
    uint8_t * sigder = auth_data_buf + 32 + 64;

    ret = ctap_parse_make_credential(&MC,encoder,request,length);

    if (ret != 0)
    {
        printf2(TAG_ERR,"error, parse_make_credential failed\n");
        return ret;
    }
    if (MC.pinAuthEmpty)
    {
        check_retr( ctap2_user_presence_test(CTAP2_UP_DELAY_MS) );
        return ctap_is_pin_set() == 1 ? CTAP2_ERR_PIN_AUTH_INVALID : CTAP2_ERR_PIN_NOT_SET;
    }
    if ((MC.paramsParsed & MC_requiredMask) != MC_requiredMask)
    {
        printf2(TAG_ERR,"error, required parameter(s) for makeCredential are missing\n");
        return CTAP2_ERR_MISSING_PARAMETER;
    }

